In [40]:
import pandas as pd
import numpy as np
import json

In [29]:
f = open('trial_task.json', encoding='utf-8')
json_object = json.load(f)

In [30]:
trial_task = pd.json_normalize(json_object)
trial_task.head(3)

,order_id,warehouse_name,highway_cost,products
0,11973,Мордор,-70,"[{'product': 'ломтик июльского неба', 'price':..."
1,62239,хутор близ Диканьки,-15,"[{'product': 'билет в Израиль', 'price': 1000,..."
2,85794,отель Лето,-50,"[{'product': 'зеленая пластинка', 'price': 10,..."

In [31]:
products = pd.json_normalize(json_object, record_path='products', meta=['order_id'])
products.head(3)

                 product  price  quantity order_id
0  ломтик июльского неба    450         1    11973
1        билет в Израиль   1000         3    11973
2       статуэтка Ленина    200         3    11973

In [32]:
trial_task.drop(['products'], axis='columns', inplace=True)
df = trial_task.merge(products, how='left', on='order_id')
df.head()

,order_id,warehouse_name,highway_cost,product,price,quantity
0,11973,Мордор,-70,ломтик июльского неба,450,1
1,11973,Мордор,-70,билет в Израиль,1000,3
2,11973,Мордор,-70,статуэтка Ленина,200,3
3,62239,хутор близ Диканьки,-15,билет в Израиль,1000,1
4,85794,отель Лето,-50,зеленая пластинка,10,2

In [33]:
df.loc[df.warehouse_name=='Мордор'].head()

,order_id,warehouse_name,highway_cost,product,price,quantity
0,11973,Мордор,-70,ломтик июльского неба,450,1
1,11973,Мордор,-70,билет в Израиль,1000,3
2,11973,Мордор,-70,статуэтка Ленина,200,3
5,33684,Мордор,-30,билет в Израиль,1000,2
6,33684,Мордор,-30,зеленая пластинка,10,1

In [34]:
df_m = df.loc[df.warehouse_name=='Мордор']
or_q = df_m['order_id'].nunique()
hc_s = df_m['highway_cost'].sum()
# q_s = df_m['quantity'].sum()
# hc_s/or_q/q_s

-1.411764705882353

In [43]:
df.loc[df.warehouse_name=='Мордор'].groupby('order_id')\
['highway_cost', 'quantity'].agg({'highway_cost': 'mean', 'quantity': sum})\
.sum()

C:\Users\serge\AppData\Local\Temp\ipykernel_3024\4045580743.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.loc[df.warehouse_name=='Мордор'].groupby('order_id')\

highway_cost   -510.0
quantity         51.0
dtype: float64

In [45]:
df.groupby(['warehouse_name', 'order_id'])\
['highway_cost', 'quantity'].agg({'highway_cost': 'mean', 'quantity': sum})

C:\Users\serge\AppData\Local\Temp\ipykernel_3024\2610957116.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.groupby(['warehouse_name', 'order_id'])\

                              highway_cost  quantity
warehouse_name      order_id
Мордор              2930             -30.0         3
                    11973            -70.0         7
                    16240            -20.0         2
                    26702            -40.0         4
                    27443            -10.0         1
...                                    ...       ...
хутор близ Диканьки 84471            -60.0         4
                    85787            -90.0         6
                    98423            -30.0         2
                    99220            -75.0         5
                    99246            -45.0         3

[100 rows x 2 columns]